app/controllers/graph_controller.rb

  def index
  	@graphTitles = ['ORDERS vs TIME', 'USERS vs TIME', 'AUDIO vs CAMERA']
  	@popular = Popular_item.first(5)
---
SELECT  `popular_items`.* FROM `popular_items`  ORDER BY `popular_items`.`id` ASC LIMIT 5

	# 	}.to_json
	results = ActiveRecord::Base.connection.execute("SELECT COALESCE(o1.charges_amount - o2.refund_charges, 0) as revenue
            FROM
            (
              SELECT COALESCE(sum(charges.amount), 0) as charges_amount
              FROM orders
              INNER JOIN charges
              ON orders.id = charges.order_id AND (charges.charge_type = 'charge' OR charges.charge_type = 'hold')
              WHERE orders.status NOT IN ('in_progress')
              AND (charges.created_at BETWEEN '2015-01-01 04:49:43' AND '2016-01-01 04:49:43')
            ) as o1
---
SELECT `orders`.* FROM `orders`  ORDER BY `orders`.`created_at` ASC

              AND (charges.created_at BETWEEN '2015-01-01 04:49:43' AND '2016-01-01 04:49:43')
            ) as o2
	")
  	orders = Order.order(:start_date)
  	users = User.order(:created_at)
---
SELECT `orders`.* FROM `orders`  ORDER BY `orders`.`start_date` ASC
SELECT `users`.* FROM `users`  ORDER BY `users`.`created_at` ASC

  def userdata
  	users = User.order(:created_at)
---
SELECT `users`.* FROM `users`  ORDER BY `users`.`created_at` ASC