app/controllers/users_controller.rb

SELECT `users`.* FROM `users`  ORDER BY `users`.`created_at` ASC
---
    def show
    	@users = User.order(:created_at)